Autodesk.Revit.DB.Structure.StructuralConnectionApplyTo
An enumerated type that represents the type of structural locations to which a connection annotation may be applied.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralConnectionApplyTo.Connection
Designate a StructuralConnectionType to apply to the Connection Handler.

Autodesk.Revit.DB.Structure.StructuralConnectionApplyTo.ColumnBase
Designate a StructuralConnectionType to apply to the base of a column.

Autodesk.Revit.DB.Structure.StructuralConnectionApplyTo.ColumnTop
Designate a StructuralConnectionType to apply to the top of a column.

Autodesk.Revit.DB.Structure.StructuralConnectionApplyTo.BeamsAndBraces
Designate a StructuralConnectionType to apply to beams and braces.